dblockil42/UsingF28379D_ForMechatronics/C2000Ware_4_01_00_00/device_support/f2802x/examples/drivers/LED_Boost_PC/LED_Boost_PC_Main.c
#endif // (INCR_BUILD == 2)

//----------------------------------------------------------------------
#if (INCR_BUILD == 3) //
//----------------------------------------------------------------------
#endif // (INCR_BUILD == 3)

//
// INTERRUPT & ISR INITIALIZATION (best to run this section after other 
// initialization)
//
    EALLOW;
    PieVectTable.EPWM1_INT = &DPL_ISR;   // Map Interrupt
    EDIS;
    PieCtrlRegs.PIEIER3.bit.INTx1 = 1;   // PIE level enable, Grp3 / Int1

    //
    // Configure ISR trigger
    //
    EPwm1Regs.ETSEL.bit.INTSEL = ET_CTR_PRD;    // INT on Period event
    EPwm1Regs.ETSEL.bit.INTEN = 1;              // Enable INT
    
    //
    // Generate ISR INT on every 3rd event
    //
    EPwm1Regs.ETPS.bit.INTPRD = ET_3RD;         
    
    //
    // Enable Peripheral, global Ints and higher priority real-time debug 
    // events:
    //
    IER |= M_INT3;    // Enable CPU INT3 connected to EPWM1-6 INTs:
    EINT;             // Enable Global interrupt INTM
    ERTM;             // Enable Global realtime interrupt DBGM

//
//    BACKGROUND (BG) LOOP
//

//--------------------------------- FRAMEWORK ---------------------------------
    for(;;)
    {
        //
        // State machine entry & exit point
        //
        
        //===========================================================
        (*Alpha_State_Ptr)();    // jump to an Alpha state (A0,B0,...)
        //===========================================================
    }
} //END MAIN CODE


//
//    STATE-MACHINE SEQUENCING AND SYNCRONIZATION
//

//--------------------------------- FRAMEWORK -------------------------------------

//
// A0 - 
//
void A0(void)
{
    //
    // loop rate synchronizer for A-tasks
    //
    if(CpuTimer0Regs.TCR.bit.TIF == 1)
    {
        CpuTimer0Regs.TCR.bit.TIF = 1;    // clear flag
        //-----------------------------------------------------------
        (*A_Task_Ptr)();         // jump to an A Task (A1,A2,A3,...)
        //-----------------------------------------------------------
        VTimer0[0]++;            // virtual timer 0, instance 0 (spare)
        SerialCommsTimer++;      // used by DSP280x_SciCommsGui.c
    }
    Alpha_State_Ptr = &B0;       // Comment out to allow only A tasks
}

//
// B0 - 
//
void B0(void)
{
    //
    // loop rate synchronizer for B-tasks
    //
    if(CpuTimer1Regs.TCR.bit.TIF == 1)
    {
        CpuTimer1Regs.TCR.bit.TIF = 1;                // clear flag
        //-----------------------------------------------------------
        (*B_Task_Ptr)();        // jump to a B Task (B1,B2,B3,...)
        //-----------------------------------------------------------
        
        //
        // virtual timer 1, instance 0 (used to control SPI LEDs)
        //
        VTimer1[0]++;
    }
    Alpha_State_Ptr = &C0;
}

//
// C0 - 
//
void C0(void)
{
    //
    // loop rate synchronizer for C-tasks
    //
    if(CpuTimer2Regs.TCR.bit.TIF == 1)
    {
        CpuTimer2Regs.TCR.bit.TIF = 1;                // clear flag
        //-----------------------------------------------------------
        (*C_Task_Ptr)();        // jump to a C Task (C1,C2,C3,...)
        //-----------------------------------------------------------
        VTimer2[0]++;           // virtual timer 2, instance 0 (spare)
    }
    Alpha_State_Ptr = &A0;      // Back to State A0
}


//
//    A - TASKS
//

//
// A1 - Over-current protection, On/Off Control
//
void A1(void)
{
    //
    // Over-current protection
    //
    if (Gui_Iout1 > OC_limit)
    {
        OCtrip = 1;
    }
    if (Gui_Iout2 > OC_limit)
    {
        OCtrip = 1;
    }
    if (Gui_Iout3 > OC_limit)
    {
        OCtrip = 1;
    }
    
    if (OCtrip)
    {
        StopAll = 1;
    }

    //
    // All Channel shut-down control (no sequencing)
    //
    if(StopAll == 1)
    {
        IrefNetBus1 = 0;
        IrefNetBus2 = 0;
        IrefNetBus3 = 0;
        ChannelEnable1 = 0;
        ChannelEnable2 = 0;
        ChannelEnable3 = 0;
        Gui_Iset1 = 0;
        Gui_Iset2 = 0;
        Gui_Iset3 = 0;
        MergeLEDs = 0;
        AutoColor = 0;
        SetColor1 = 0;
        SetColor2 = 0;
        StopAll = 0;
    }
    
    if (EnableAll == 1)
    {
        ChannelEnable1 = 1;
        ChannelEnable2 = 1;
        ChannelEnable3 = 1;
        EnableAll = 0;
    }

    //
    // Channel 1 On/Off control
    //
    if(ChannelEnable1 == 1)
    {
        Itarget1 = Iset1;
    }
    else
    {
        Itarget1 = 0;
    }
    
    //
    // Channel 2 On/Off control
    //
    if(ChannelEnable2 == 1)
    {
        Itarget2 = Iset2;
    }
    else
    {
        Itarget2 = 0;
    }
    
    //
    // Channel 3 On/Off control
    //
    if(ChannelEnable3 == 1)
    {
        Itarget3 = Iset3;
    }
    else
    {
        Itarget3 = 0;
    }

    //-------------------
    A_Task_Ptr = &A2;
    //-------------------
}

//
// A2 - SCI GUI, Slew control, LED current control
//
void A2(void) 
{
    SerialHostComms();    //found in SciCommsGui.c

    //
    // This code ensures that each channel's current ramps at a given slew rate
    // at a rate defined by SlewStep.
    // Derivation shown in attached Excel Spreadsheet
    //
    SlewError = (IrefNetBus1 - Itarget1);
    if (SlewError > SlewStep1)
    {
        IrefNetBus1 = IrefNetBus1 - SlewStep1;
    }
    else if (SlewError < (-SlewStep1) )
    {
        IrefNetBus1 = IrefNetBus1 + SlewStep1;
    }
    else
    {
        IrefNetBus1 = Itarget1;
    }

    SlewError = (IrefNetBus2 - Itarget2);
    if (SlewError > SlewStep2)
    {
        IrefNetBus2 = IrefNetBus2 - SlewStep2;
    }
    else if (SlewError < (-SlewStep2) )
    {
        IrefNetBus2 = IrefNetBus2 + SlewStep2;
    }
    else
    {
        IrefNetBus2 = Itarget2;
    }

    SlewError = (IrefNetBus3 - Itarget3);
    if (SlewError > SlewStep3)
    {
        IrefNetBus3 = IrefNetBus3 - SlewStep3;
    }
    else if (SlewError < (-SlewStep3) )
    {
        IrefNetBus3 = IrefNetBus3 + SlewStep3;
    }
    else
    {
        IrefNetBus3 = Itarget3;
    }

    //
    // Current setting calculated by:
    // Iset = Gui_Iset * iK_Iout, where iK_Iout = 1/K_Iout 
    // (i.e. inverse K_Iout) view and set following variables in Watch Window 
    // as:
    // Gui_Iset = Q15
    //

    //
    // Multiply with longs to get proper result then shift by 14 to turn it 
    // back into an int16
    //
    Iset1 = ((long)Gui_Iset1*(long)iK_Iset) >> 5;
    Iset2 = ((long)Gui_Iset2*(long)iK_Iset) >> 5;
    Iset3 = ((long)Gui_Iset3*(long)iK_Iset) >> 5;

    //-------------------
    A_Task_Ptr = &A1;
    //-------------------
}

//
// comp - Hardware fix for poor feedback path on LED Boosterpack
//
void comp(void) 
{
    if((Gui_Iset1 == 0) && (AdcNetBus[1] == 0) && (UoutNetBus1 >= _IQ24(0.001)))
    {
        AdcNetBus[1] = 40960;
    }
    if((Gui_Iset2 == 0) && (AdcNetBus[2] == 0) && (UoutNetBus2 >= _IQ24(0.001)))
    {
        AdcNetBus[2] = 40960;
    }
    if((Gui_Iset3 == 0) && (AdcNetBus[3] == 0) && (UoutNetBus3 >= _IQ24(0.001)))
    {
        AdcNetBus[3] = 40960;
    }
}

//
//    B - TASKS
//

//----------------------------------- USER ------------------------------------

//
// B1 - Current Dashboard measurements
//
void B1(void) 
{
    //
    // Measurement code expandable to multiple channels, defined by 
    // "NumChannels"
    // Voltage measurement calculated by:
    // Gui_Vout = VoutAvg * K_Vout, where VoutAvg = sum of 8 VoutR samples
    //
    HistPtr++;
    if (HistPtr >= HistorySize)
    {
        HistPtr = 0;
    }

    //
    // BoxCar Averages - Input Raw samples into BoxCar arrays
    //
    Hist_Iout1[HistPtr] = Iout1R;
    Hist_Iout2[HistPtr] = Iout2R;
    Hist_Iout3[HistPtr] = Iout3R;
    Hist_Vout1[HistPtr] = Vout1R;
    Hist_Vout2[HistPtr] = Vout2R;
    Hist_Vout3[HistPtr] = Vout3R;
    Hist_Vin[HistPtr] = VinR;

    //
    // Current Measurement
    //
    // view following variables in Watch Window as:
    //        Gui_Vout = Q10
    //
    temp_Scratch=0;
    for(i=0; i<HistorySize; i++)
    {
        temp_Scratch = temp_Scratch + Hist_Iout1[i];     // Q12 * 8 = Q15
    }
    Gui_Iout1 = ((long)temp_Scratch*(long)K_Iout) >> 15; // Q15*Q15 >> 15 = Q15

    temp_Scratch=0;
    for(i=0; i<HistorySize; i++)
    {
        temp_Scratch = temp_Scratch + Hist_Iout2[i];     // Q12 * 8 = Q15
    }
    Gui_Iout2 = ((long)temp_Scratch*(long)K_Iout) >> 15; // Q15*Q15 >> 15 = Q15

    temp_Scratch=0;
    for(i=0; i<HistorySize; i++)
    {
        temp_Scratch = temp_Scratch + Hist_Iout3[i];     // Q12 * 8 = Q15
    }
    Gui_Iout3 = ((long)temp_Scratch*(long)K_Iout) >> 15; // Q15*Q15 >> 15 = Q15

    //-----------------
    B_Task_Ptr = &B2;    
    //-----------------
}

//
// B2 - Voltage Dashboard measurements
//
void B2(void)
{
    //
    // Measurement code expandable to multiple channels, defined by 
    // "NumChannels"
    // Voltage measurement calculated by:
    // Gui_Vout = VoutAvg * K_Vout, where VoutAvg = sum of 8 VoutR samples
    //
    HistPtr++;
    if (HistPtr >= HistorySize)
    {
        HistPtr = 0;
    }

    //
    // BoxCar Averages - Input Raw samples into BoxCar arrays
    //
    Hist_Iout1[HistPtr] = Iout1R;
    Hist_Iout2[HistPtr] = Iout2R;
    Hist_Iout3[HistPtr] = Iout3R;
    Hist_Vout1[HistPtr] = Vout1R;
    Hist_Vout2[HistPtr] = Vout2R;
    Hist_Vout3[HistPtr] = Vout3R;
    Hist_Vin[HistPtr] = VinR;

    //
    // Voltage Measurement
    //
    // view following variables in Watch Window as:
    //        Gui_Vout = Q10
    //
    temp_Scratch=0;
    for(i=0; i<HistorySize; i++)
    {
        temp_Scratch = temp_Scratch + Hist_Vout1[i];     // Q12 * 8 = Q15
    }
    Gui_Vout1 = ((long)temp_Scratch*(long)K_Vout) >> 15; // Q15*Q15 >> 15 = Q15

    temp_Scratch=0;
    for(i=0; i<HistorySize; i++)
    {
        temp_Scratch = temp_Scratch + Hist_Vout2[i];     // Q12 * 8 = Q15
    }
    Gui_Vout2 = ((long)temp_Scratch*(long)K_Vout) >> 15; // Q15*Q15 >> 15 = Q15

    temp_Scratch=0;
    for(i=0; i<HistorySize; i++)
    {
        temp_Scratch = temp_Scratch + Hist_Vout3[i];     // Q12 * 8 = Q15
    }
    Gui_Vout3 = ((long)temp_Scratch*(long)K_Vout) >> 15; // Q15*Q15 >> 15 = Q15

    temp_Scratch=0;
    for(i=0; i<HistorySize; i++)
    {
        temp_Scratch = temp_Scratch + Hist_Vin[i];      // Q12 * 8 = Q15
    }
    Gui_Vin = ((long)temp_Scratch*(long)K_Vin) >> 15;   // Q15*Q15 >> 15 = Q15

    //-----------------
    B_Task_Ptr = &B1;    
    //-----------------
}

//
//    C - TASKS
//

