dblockil42/UsingF28379D_ForMechatronics/C2000Ware_4_01_00_00/device_support/f2802x/examples/drivers/LED_Boost_PC/LED_Boost_PC_Main.c
//----------------------------- USER ------------------------------------------

//
// C1 - Blinking LED control
//
void C1(void) 
{
    //-----------------
    C_Task_Ptr = &C2;    
    //-----------------
}

//
// C2- Automatic color control, Manual color control
//
void C2(void) 
{
    #define AutoColorMIN 253670
    
    if (AutoColor)
    {
		SlewStep1 = 3*60;
		SlewStep2 = 1*60;
		SlewStep3 = 5*60;
		
		if (IrefNetBus1 <= AutoColorMIN)
		{
            Gui_Iset1 = 0.03*32768;
        }
		else if (IrefNetBus1 == Itarget1)
        {
            Gui_Iset1 = 0.01*32768;
        }
		if (IrefNetBus2 <= AutoColorMIN)
        {
            Gui_Iset2 = 0.05*32768;
        }
		else if (IrefNetBus2 == Itarget2)
        {
            Gui_Iset2 = 0.01*32768;
        }
		if (IrefNetBus3 <= AutoColorMIN)
        {
            Gui_Iset3 = 0.06*32768;
        }
		else if (IrefNetBus3 == Itarget3)
        {
            Gui_Iset3 = 0.01*32768;
        }

		ResetSlew = 1;
    }
    else
    {
        if (ResetSlew == 1)
        {
            SlewStep1 = SlewStepAll;
            SlewStep2 = SlewStepAll;
            SlewStep3 = SlewStepAll;
            ResetSlew = 0;
        }    
    }

    if (!AutoColor)
    {    
        switch(SetColor1)
        {
            case 0:
                break;
            case 99:    // Off
                Gui_Iset1 = 0;
                Gui_Iset2 = 0;
                Gui_Iset3 = 0;
                break;
            case 1:        // Red
                Gui_Iset1 = 0;
                Gui_Iset2 = 0;
                Gui_Iset3 = 0.03*32768;
                break;
            case 2:        // Orange
                Gui_Iset1 = 0;
                Gui_Iset2 = 0.01*32768;
                Gui_Iset3 = 0.035*32768;
                break;
            case 3:        // Yellow
                Gui_Iset1 = 0;;
                Gui_Iset2 = 0.025*32768;
                Gui_Iset3 = 0.035*32768;
                break;
            case 4:        // Green
                Gui_Iset1 = 0;
                Gui_Iset2 = 0.03*32768;
                Gui_Iset3 = 0;
                break;
            case 5:        // Blue
                Gui_Iset1 = 0.03*32768;
                Gui_Iset2 = 0;
                Gui_Iset3 = 0;
                break;
            case 6:        // Purple
                Gui_Iset1 = 0.025*32768;
                Gui_Iset2 = 0;
                Gui_Iset3 = 0.025*32768;
                break;
            case 7:        // White
                Gui_Iset1 = 0.015*32768;
                Gui_Iset2 = 0.02*32768;
                Gui_Iset3 = 0.025*32768;
                break;
            case 8:           // Black
                Gui_Iset1 = 0;
                Gui_Iset2 = 0;
                Gui_Iset3 = 0;
                break;

            default:
                break;
        } // SetColor1
        SetColor1 = 0;

    } // !AutoColor

    //-----------------
    C_Task_Ptr = &C1;    
    //-----------------
}

//
// End of File
//

